app/Http/Controllers/CommuneController.php

    public function getcommunes(Request $request)
    {
        // dd($id->all());
        $province_id = $request->cd_prov;
        if (Province::exists($province_id)) {
            return response()->json(Commune::where(['cd_prov'=>$province_id])->pluck('ll_com','id'));
---
select exists(select * from `provinces`) as `exists`
select `ll_com`, `id` from `communes` where (`cd_prov` = '275')