app/Http/Controllers/EtabController.php

    public function index(Request $request)
    {
        // $cycle = [];
        $provinces = Province::pluck('ll_prov','id');
        if ($request->all()) {
            switch ($request->cycle_id) {
                case 1:
                    $cycle = ['enspres',1];
                    break;
                case 2:
                    $cycle = [['ensprimg'=>1],['ensprimo'=>1]];
                    break;
                case 3:
                    $cycle = [['enscolg'=>1], ['enscolo'=>1]];
                    break;
                case 4:
                    $cycle = [['ensqualg'=>1], ['ensqualo'=>1], ['ensqualt'=>1]];
                    break;
            }
            // dd($cycle);
            $etabs = Etab::where('cd_com', $request->commune_id)
                ->where('typeetab', '<>', 'Prive')
                ->Where(function($qr) use ($cycle){
                    foreach ($cycle as $key => $cyc) {
                        $qr->orWhere($cyc);
                    }
                })->get();
            // dd($etabs);
            $natures = Nature::pluck('NetabFr', 'id');
            $communes = Commune::where('cd_prov',$request->province_id)->pluck('ll_com', 'id');
---
select `ll_prov`, `id` from `provinces`
select * from `etabs` where `cd_com` = '2750135' and `typeetab` <> 'Prive' and ((`ensprimg` = 1) or (`ensprimo` = 1))
select `NetabFr`, `id` from `natures`
select `ll_com`, `id` from `communes` where `cd_prov` = '275'

    public function show($cd_etab)
    {
        $etab = Etab::where('cd_etab', $cd_etab)->with(['commune' => function($qr){
            $qr->select(['id', 'll_com', 'cd_prov'])->with('province:id,ll_prov');
        }])->first();
        $details = Detail::where('gresa', $cd_etab)->first();
---
select `id`, `ll_com`, `cd_prov` from `communes` where `communes`.`id` in (2750135)
select `id`, `ll_prov` from `provinces` where `provinces`.`id` in (275)
select * from `details` where `gresa` = '04695C' limit 1