app/Http/Controllers/HomeController.php

    public function index()
    {
        $province['provinces'] = Province::count();
        $province['etabs'] = Etab::where('df_etab', null)->count();
        $province['communes'] = Commune::count();
        $etabs = Etab::where('df_etab', null)->pluck('cd_etab');
---
select count(*) as aggregate from `provinces`
select count(*) as aggregate from `etabs` where `df_etab` is null
select count(*) as aggregate from `communes`
select `cd_etab` from `etabs` where `df_etab` is null