app/Http/Controllers/ProvinceController.php

    public function show($id)
    {
        $province = Province::withCount(['commune' ,'etabs' => function($qr){
            $qr->where('df_etab', null); //ouvertes
        }])->where('id',$id)->first();
---
select * from `provinces` where `id` = '113' limit 1